import React from "react";

const ExportGroup = () => {
  return (
    <div className="flex-col  pt-16 ">
      <div className="relative bg-slate-500 h-80 rounded-lg ">
        <div
          className="absolute inset-0 bg-cover bg-center  bg-opacity-75 shadow-xl rounded-lg"
          style={{
            backgroundImage:
              "url(https://images.pexels.com/photos/163726/belgium-antwerp-shipping-container-163726.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2)",
          }}
        >
          <div className="absolute top-0 left-0 right-0 bottom-0 bg-black/50 z-[2] rounded-lg">
            <h1 className="absolute text-5xl bottom-4 left-4  md:bottom-10 md:left-20 text-white font-bold">
              VỀ CHÚNG TÔI
            </h1>
          </div>
        </div>
      </div>
      <div className="bg-white ">
        <div className="grid md:grid-cols-2 gap-10  md:mx-20 mx-10  ">
          <div className="font-bold text-2xl textcomponent mt-20 ">
            Ahamove là thương hiệu giao hàng theo nhu cầu chuyên nghiệp với nền
            tảng công nghệ hiện đại nhất khu vực được tối ưu hoá cho nhu cầu của
            địa phương, đáp ứng mọi nhu cầu vận chuyển của người tiêu dùng và
            chủ doanh nghiệp.
          </div>
          <div className="textcomponent mt-20">
            Thành lập từ năm 2015, Ahamove là dịch vụ giúp hơn 300.000 chủ shop,
            chủ doanh nghiệp ship hàng nội thành tại Hà Nội, TP. HCM và 7 thành
            phố khác với tốc độ nhanh, chi phí hợp lý và đội ngũ shipper hùng
            hậu. Với thế mạnh là đội ngũ kĩ sư công nghệ chuyên giải quyết các
            bài toán khu vực, Ahamove cung cấp cho cả khách hàng và tài xế những
            công cụ giúp tăng năng suất làm việc, tối đa hóa lợi ích như phần
            mềm dịch vụ SaaS quản lý vận hành hay công nghệ bản đồ tối ưu quãng
            đường. Ahamove là mong muốn đơn giản hóa việc giao hàng, giúp các
            chủ cửa hàng vừa và nhỏ tại Việt Nam cũng có thể tận hưởng một dịch
            vụ cao cấp, tiện lợi nhưng với giá cả hợp lý. Ahamove đang giúp hơn
            30.000 tài xế Việt có thu nhập hàng tháng với chính sách phí và
            thưởng hấp dẫn.
          </div>
        </div>
        <div className="grid md:grid-cols-2 gap-10 mt-20 md:mx-20 mx-10">
          <div className="textcomponent " data-aos="zoom-in-down">
            <svg
              viewBox="0 0 1024 1024"
              className="icon"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              fill="#000000"
              width={80}
              height={80}
            >
              <g id="SVGRepo_bgCarrier" strokeWidth="0"></g>
              <g
                id="SVGRepo_tracerCarrier"
                strokeLinecap="round"
                strokeLinejoin="round"
              ></g>
              <g id="SVGRepo_iconCarrier">
                <path
                  d="M330.147 727.583l-3.105-2.113c-23.995-16.366-56.736-10.206-73.12 13.753L120.381 934.43c-16.389 23.958-10.22 56.646 13.779 73.002l3.1 2.118c24 16.366 56.741 10.206 73.125-13.752l133.542-195.207c16.388-23.959 10.219-56.642-13.78-73.008z"
                  fill="#E5594F"
                ></path>
                <path
                  d="M457.934 727.583l-3.1-2.113c-23.999-16.366-56.74-10.206-73.129 13.753L248.168 934.43c-16.388 23.958-10.22 56.646 13.775 73.002l3.109 2.118c23.995 16.366 56.736 10.206 73.12-13.752l133.537-195.207c16.394-23.959 10.225-56.642-13.775-73.008z"
                  fill="#F0D043"
                ></path>
                <path
                  d="M895.09 934.213L761.813 740.007c-16.353-23.837-49.03-29.961-72.979-13.689l-3.101 2.108c-23.949 16.28-30.104 48.796-13.748 72.629L805.26 995.261c16.357 23.838 49.031 29.971 72.98 13.686l3.101-2.1c23.95-16.282 30.105-48.797 13.749-72.634z"
                  fill="#E5594F"
                ></path>
                <path
                  d="M767.555 934.213L634.279 740.007c-16.357-23.837-49.031-29.961-72.985-13.689l-3.096 2.108c-23.954 16.28-30.109 48.796-13.752 72.629l133.275 194.206c16.357 23.838 49.03 29.971 72.984 13.686l3.096-2.1c23.955-16.282 30.11-48.797 13.754-72.634z"
                  fill="#F0D043"
                ></path>
                <path
                  d="M712.252 364.688L577.453 338.78l-66.275-120.278-66.28 120.278-134.794 25.908 93.834 100.25-17.037 136.291 124.277-58.327 124.272 58.327-17.037-136.291z"
                  fill="#F39A2B"
                ></path>
                <path
                  d="M803.625 434.496c-1.459 160.596-131.855 290.993-292.452 292.453-76.346 0.693-150.076-30.799-204.647-83.529-56.995-55.073-87.084-130.821-87.796-208.923-0.676-74.35-116.033-74.415-115.355 0 2.034 223.497 184.3 405.775 407.798 407.807 223.519 2.032 405.803-187.375 407.808-407.807 0.675-74.416-114.679-74.351-115.356-0.001z"
                  fill="#f29382"
                ></path>
                <path
                  d="M218.73 415.399c1.462-160.594 131.845-290.992 292.443-292.455 76.347-0.696 150.079 30.801 204.647 83.531 56.997 55.075 87.093 130.822 87.805 208.923 0.677 74.35 116.031 74.416 115.355 0C916.948 191.905 734.669 9.624 511.173 7.589c-223.518-2.035-405.793 187.38-407.798 407.81-0.678 74.415 114.679 74.35 115.355 0z"
                  fill="#f29382"
                ></path>
              </g>
            </svg>
            <div className="mt-5 font-bold text-3xl textcomponent">Sứ mệnh</div>
            <div className="mt-5 textcomponent">
              Ahamove là thương hiệu giao hàng theo nhu cầu chuyên nghiệp với
              nền tảng công nghệ hiện đại nhất khu vực được tối ưu hoá cho nhu
              cầu của địa phương, đáp ứng mọi nhu cầu vận chuyển của người tiêu
              dùng và chủ doanh nghiệp.
            </div>
          </div>
          <div data-aos="zoom-in-down">
            <svg
              viewBox="0 0 1024 1024"
              className="icon"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              fill="#000000"
              width={80}
              height={80}
            >
              <g id="SVGRepo_bgCarrier" strokeWidth="0"></g>
              <g
                id="SVGRepo_tracerCarrier"
                strokeLinecap="round"
                strokeLinejoin="round"
              ></g>
              <g id="SVGRepo_iconCarrier">
                <path
                  d="M94.433 536.378c49.818-67.226 110.761-124.854 180.172-166.808 35.333-21.356 62.64-33.686 99.016-45.698 17.076-5.638 34.511-10.135 52.088-13.898 23.033-4.932 28.596-5.483 49.577-7.228 76.233-6.333 138.449 4.648 210.869 33.643 3.581 1.435 10.361 4.513 18.987 8.594 8.488 4.013 16.816 8.358 25.086 12.801 18.349 9.861 36.004 20.974 53.173 32.756 31.245 21.442 62.37 49.184 91.227 79.147 20.218 20.991 39.395 43.706 56.427 66.689 14.436 19.479 38.301 29.282 60.985 15.991 19.248-11.276 30.491-41.417 15.991-60.984-101.194-136.555-243.302-247.3-415.205-272.778-165.834-24.575-325.153 31.855-452.148 138.262-46.849 39.252-86.915 85.525-123.221 134.518-14.5 19.567-3.258 49.708 15.991 60.984 22.685 13.291 46.549 3.488 60.985-15.991z"
                  fill="#c21414"
                ></path>
                <path
                  d="M931.055 491.378c-49.817 67.228-110.761 124.856-180.173 166.811-35.332 21.354-62.639 33.684-99.015 45.694-17.076 5.641-34.512 10.137-52.09 13.902-23.032 4.931-28.593 5.48-49.576 7.225-76.233 6.336-138.449-4.648-210.869-33.642-3.582-1.436-10.362-4.514-18.987-8.595-8.488-4.015-16.816-8.357-25.087-12.801-18.348-9.862-36.003-20.974-53.172-32.755-31.245-21.443-62.37-49.184-91.227-79.149-20.218-20.99-39.395-43.705-56.427-66.69-14.436-19.479-38.3-29.279-60.985-15.991-19.249 11.276-30.491 41.419-15.991 60.984C118.65 672.929 260.76 783.677 432.661 809.15c165.834 24.578 325.152-31.854 452.148-138.259 46.85-39.256 86.915-85.528 123.222-134.521 14.5-19.564 3.257-49.708-15.991-60.984-22.685-13.287-46.55-3.487-60.985 15.992z"
                  fill="#c21414"
                ></path>
                <path
                  d="M594.746 519.234c0.03 46.266-34.587 83.401-80.113 85.188-46.243 1.814-83.453-35.93-85.188-80.11-0.953-24.271-19.555-44.574-44.574-44.574-23.577 0-45.527 20.281-44.573 44.574 3.705 94.378 79.154 169.32 174.334 169.258 94.457-0.063 169.321-81.897 169.261-174.335-0.039-57.486-89.184-57.49-89.147-0.001z"
                  fill="#F39A2B"
                ></path>
                <path
                  d="M430.688 514.818c0.876-45.416 37.262-81.797 82.677-82.672 45.438-0.875 81.824 38.571 82.673 82.672 1.105 57.413 90.256 57.521 89.147 0-1.827-94.791-77.028-169.994-171.82-171.82-94.787-1.827-170.049 79.785-171.824 171.82-1.108 57.522 88.04 57.413 89.147 0z"
                  fill="#E5594F"
                ></path>
              </g>
            </svg>
            <div className="mt-5 font-bold text-3xl textcomponent ">
              Tầm nhìn
            </div>
            <div className="mt-5 textcomponent ">
              Vươn lên hàng đầu trong lĩnh vực ứng dụng công nghệ giao hàng Việt
              Nam và vươn ra khu vực
            </div>
          </div>
        </div>
        <div className="flex justify-center mt-20 textTitleLarge">
          Giá trị cốt lõi
        </div>
        <div className="grid md:grid-cols-3 gap-10 mt-20 md:mx-20 mx-10 ">
          <div>
            <div>
              <svg
                viewBox="0 0 1024 1024"
                className="icon"
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                fill="#000000"
                width={80}
                height={80}
              >
                <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                <g
                  id="SVGRepo_tracerCarrier"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></g>
                <g id="SVGRepo_iconCarrier">
                  <path
                    d="M597.678 480.76L390.797 333.998c-22.209-15.766-53-10.532-68.762 11.687l-2.04 2.871c-15.753 22.214-10.526 53 11.691 68.762l206.876 146.771c22.218 15.757 53 10.527 68.766-11.687l2.035-2.876c15.768-22.218 10.529-53.005-11.685-68.766z"
                    fill="#F39A2B"
                  ></path>
                  <path
                    d="M585.066 423.392l-2.871-2.034c-22.218-15.763-53.004-10.527-68.766 11.687L279.007 763.472c-15.762 22.214-10.527 53.005 11.69 68.763l2.871 2.04c22.218 15.762 53.004 10.53 68.762-11.688l234.423-330.428c15.767-22.22 10.531-53.001-11.687-68.767z"
                    fill="#E5594F"
                  ></path>
                  <path
                    d="M891.662 525.126c-0.363 50.106-8.104 91.767-27.502 142.522-13.232 34.625-44.231 82.177-70.529 111.108-62.993 69.31-152.478 113.292-240.772 121.615-100.773 9.501-189.621-17.478-271.287-78.551 7.65 5.723-7.536-6.408-7.061-6.009-4.562-3.821-8.967-7.82-13.369-11.824-8.803-8.003-17.105-16.535-25.225-25.224-18.148-19.432-26.188-30.526-41.439-54.866-27.11-43.264-40.704-80.283-51.007-132.536-4.015-20.354-5.395-39.803-5.586-66.233-0.531-73.33-114.29-73.381-113.758 0 1.607 222.487 154.098 420.146 370.093 475.715 216.482 55.697 449.039-49.258 553.91-245.54 37.754-70.664 56.715-150.224 57.293-230.179 0.526-73.379-113.231-73.328-113.761 0.002z"
                    fill="#4A5699"
                  ></path>
                  <path
                    d="M137.884 501.467c0.362-50.104 8.103-91.762 27.502-142.52 13.233-34.621 44.233-82.173 70.53-111.108 62.993-69.309 152.472-113.29 240.768-121.615 100.773-9.5 189.626 17.479 271.292 78.554-7.652-5.721 7.532 6.408 7.057 6.01 4.563 3.819 8.968 7.821 13.371 11.823 8.803 8 17.108 16.535 25.228 25.225 18.147 19.43 26.187 30.526 41.438 54.866 27.111 43.264 40.709 80.28 51.009 132.533 4.014 20.352 5.396 39.804 5.586 66.232 0.529 73.33 114.287 73.384 113.76 0-1.608-222.489-154.107-420.144-370.099-475.715-216.482-55.7-449.036 49.26-553.905 245.541-37.753 70.664-56.715 150.219-57.292 230.174-0.534 73.384 113.225 73.33 113.755 0z"
                    fill="#C45FA0"
                  ></path>
                </g>
              </svg>
            </div>
            <div className="textTitleMedium mt-5">Tốc độ</div>
            <div className="mt-2">
              Luôn dẫn đầu, bắt kịp những công nghệ mới nhất. Luôn nắm bắt sớm
              nhất nhu cầu khách hàng. Đảm bảo nhanh chóng trong tốc độ cung cấp
              dịch vụ và sản phẩm.
            </div>
          </div>
          <div>
            <div>
              <svg
                viewBox="0 0 1024 1024"
                className="icon"
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                fill="#000000"
                width={80}
                height={80}
              >
                <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                <g
                  id="SVGRepo_tracerCarrier"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></g>
                <g id="SVGRepo_iconCarrier">
                  <path
                    d="M691.573 338.89c-1.282 109.275-89.055 197.047-198.33 198.331-109.292 1.282-197.065-90.984-198.325-198.331-0.809-68.918-107.758-68.998-106.948 0 1.968 167.591 137.681 303.31 305.272 305.278C660.85 646.136 796.587 503.52 798.521 338.89c0.811-68.998-106.136-68.918-106.948 0z"
                    fill="#4A5699"
                  ></path>
                  <path
                    d="M294.918 325.158c1.283-109.272 89.051-197.047 198.325-198.33 109.292-1.283 197.068 90.983 198.33 198.33 0.812 68.919 107.759 68.998 106.948 0C796.555 157.567 660.839 21.842 493.243 19.88c-167.604-1.963-303.341 140.65-305.272 305.278-0.811 68.998 106.139 68.919 106.947 0z"
                    fill="#C45FA0"
                  ></path>
                  <path
                    d="M222.324 959.994c0.65-74.688 29.145-144.534 80.868-197.979 53.219-54.995 126.117-84.134 201.904-84.794 74.199-0.646 145.202 29.791 197.979 80.867 54.995 53.219 84.13 126.119 84.79 201.905 0.603 68.932 107.549 68.99 106.947 0-1.857-213.527-176.184-387.865-389.716-389.721-213.551-1.854-387.885 178.986-389.721 389.721-0.601 68.991 106.349 68.933 106.949 0.001z"
                    fill="#E5594F"
                  ></path>
                </g>
              </svg>
            </div>
            <div className="textTitleMedium mt-5">Đồng hành</div>
            <div className="mt-5">
              Để tiến xa, chúng ta đi cùng nhau. Đồng hành để thấu hiểu và đón
              đầu những nhu cầu mới, để luôn có mặt khi cần và hỗ trợ trên từng
              chuyến hàng.
            </div>
          </div>
          <div>
            <div>
              <svg
                viewBox="0 0 1024 1024"
                className="icon"
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                fill="#000000"
                width={80}
                height={80}
              >
                <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                <g
                  id="SVGRepo_tracerCarrier"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></g>
                <g id="SVGRepo_iconCarrier">
                  <path
                    d="M736.68 435.86a173.773 173.773 0 0 1 172.042 172.038c0.578 44.907-18.093 87.822-48.461 119.698-32.761 34.387-76.991 51.744-123.581 52.343-68.202 0.876-68.284 106.718 0 105.841 152.654-1.964 275.918-125.229 277.883-277.883 1.964-152.664-128.188-275.956-277.883-277.879-68.284-0.878-68.202 104.965 0 105.842zM285.262 779.307A173.773 173.773 0 0 1 113.22 607.266c-0.577-44.909 18.09-87.823 48.461-119.705 32.759-34.386 76.988-51.737 123.58-52.337 68.2-0.877 68.284-106.721 0-105.842C132.605 331.344 9.341 454.607 7.379 607.266 5.417 759.929 135.565 883.225 285.262 885.148c68.284 0.876 68.2-104.965 0-105.841z"
                    fill="#4A5699"
                  ></path>
                  <path
                    d="M339.68 384.204a173.762 173.762 0 0 1 172.037-172.038c44.908-0.577 87.822 18.092 119.698 48.462 34.388 32.759 51.743 76.985 52.343 123.576 0.877 68.199 106.72 68.284 105.843 0-1.964-152.653-125.231-275.917-277.884-277.879-152.664-1.962-275.954 128.182-277.878 277.879-0.88 68.284 104.964 68.199 105.841 0z"
                    fill="#C45FA0"
                  ></path>
                  <path
                    d="M545.039 473.078c16.542 16.542 16.542 43.356 0 59.896l-122.89 122.895c-16.542 16.538-43.357 16.538-59.896 0-16.542-16.546-16.542-43.362 0-59.899l122.892-122.892c16.537-16.542 43.355-16.542 59.894 0z"
                    fill="#F39A2B"
                  ></path>
                  <path
                    d="M485.17 473.078c16.537-16.539 43.354-16.539 59.892 0l122.896 122.896c16.538 16.533 16.538 43.354 0 59.896-16.541 16.538-43.361 16.538-59.898 0L485.17 532.979c-16.547-16.543-16.547-43.359 0-59.901z"
                    fill="#F39A2B"
                  ></path>
                  <path
                    d="M514.045 634.097c23.972 0 43.402 19.433 43.402 43.399v178.086c0 23.968-19.432 43.398-43.402 43.398-23.964 0-43.396-19.432-43.396-43.398V677.496c0.001-23.968 19.433-43.399 43.396-43.399z"
                    fill="#E5594F"
                  ></path>
                </g>
              </svg>
            </div>
            <div className="textTitleMedium mt-5">Đổi mới</div>
            <div className="mt-5">
              Tại Ahamove, đổi mới luôn diễn ra từng giờ, từng ngày, trong mọi
              hoạt động. Chúng ta không hài lòng với thành quả đang có và luôn
              tìm kiếm những giải pháp tốt hơn.
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default ExportGroup;
